Revit 2026 API

# LinkedResourceOpeningEventArgs Class

---

The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpening].

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.DB.EventsLinkedResourceOpeningEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkedResourceOpeningEventArgs : RevitAPIPreEventArgs
```
```vb
Public Class LinkedResourceOpeningEventArgs
	Inherits RevitAPIPreEventArgs
```
```cpp
public ref class LinkedResourceOpeningEventArgs : public RevitAPIPreEventArgs
```
```fsharp
type LinkedResourceOpeningEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
```

The LinkedResourceOpeningEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | LinkedResourcePathName | Path of the linked resource. |
|  | ResourceType | The desired linked resource type. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace